'''
基础第一节:python综述

基础第二节:基本数据类型

基础第三节;字符串使用

基础第四节;数据类型之list / tuple

基础第五节;数据类型之dict / set

基础第六节;python流程控制

基础第七节;函数

基础第八节;python模块及包管理

基础第九节;python常用内置函数

基础第十节;python异常处理

基础第十一节;python之文件操作


进阶第一节;面向对象编程一

进阶第二节;面向对象编程二

进阶第三节;函数式编程

进阶第四节;迭代器 / 生成器

进阶第五节;python装饰器

进阶第六节;IO编程

进阶第七节;进程和线程一

进阶第八节;进程和线程二

进阶第九节;python协程

进阶第十节;正则表达式一

进阶第十一节;正则表达式二

进阶第十二节;python常用模块一

进阶第十三节;python常用模块和第三方库二

进阶第十四节;python常用模块和第三方库三

进阶第十五节;python常用模块和第三方库四

进阶第十六节;python代码调试与测试

进阶第十七节;Python内存管理

进阶第十八节;Python性能与优化

进阶第十九节;python网络编程

进阶第二十节;阶段性总结

'''
